{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "На вход программы подается вещественное число: стоимость одной книги x рублей. Необходимо прочитать это число и вывести на экран в одну строчку через пробел стоимости 2, 3, ... 10-ти таких книг с точностью до десятых. Программу реализовать при помощи цикла while."
      ],
      "metadata": {
        "id": "k1c1uqhWo4QY"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "a = float(input())\n",
        "k = 2\n",
        "m = []\n",
        "while k<=10:\n",
        "    m.append(round(a*k,1))\n",
        "    k+=1\n",
        "print(*m)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "GqbvqRa9o6S5",
        "outputId": "6d4f971f-f91e-455a-8f24-c37543e22986"
      },
      "execution_count": 1,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "34.6\n",
            "69.2 103.8 138.4 173.0 207.6 242.2 276.8 311.4 346.0\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "На вход программе подается натуральное число (то есть, целое положительное) от трехзначного и более. Необходимо прочитать это число и найти произведение всех его цифр. Результат (произведение) вывести на экран. Программу реализовать при помощи цикла while."
      ],
      "metadata": {
        "id": "-9EwCL8spb5V"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "a = list(map(int, input()))\n",
        "k = 0\n",
        "d = 1\n",
        "while k<=(len(a)-1):\n",
        "    d = d*a[k]\n",
        "    k+=1\n",
        "print(d)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "nSVwb2oEpR7g",
        "outputId": "95c21fff-a792-4c45-d102-53eb790077ea"
      },
      "execution_count": 2,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "821\n",
            "16\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "На вход программе подаются два натуральных числа n и m, записанных в одну строчку через пробел, причем n < m. Необходимо прочитать эти числа и напечатать все нечетные числа из интервала [n, m]. Задачу следует решить без применения условного оператора. Результат вывести на экран в виде строки чисел, записанных через пробел. Программу реализовать при помощи цикла while."
      ],
      "metadata": {
        "id": "54LsDTEQpi1T"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "n,m = map(int, input().split())\n",
        "a = []\n",
        "while n<=m:\n",
        "    if n%2==1:\n",
        "        a.append(n)\n",
        "    else:\n",
        "        pass\n",
        "    n+=1\n",
        "print(*a)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "EReeAmXMpjOO",
        "outputId": "9e2b448c-8fec-4ce5-f3ae-8bd5d4ea1778"
      },
      "execution_count": 3,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "2 10\n",
            "3 5 7 9\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Составить программу поиска всех трехзначных чисел, которые при делении на 47 дают в остатке 43 и кратны 3. Вывести найденные числа в одну строчку через пробел в порядке возрастания. Программу реализовать при помощи цикла while."
      ],
      "metadata": {
        "id": "Qu3kiBV-pyO_"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "a = 100\n",
        "n= []\n",
        "while a<1000:\n",
        "    if a%47==43 and a%3==0:\n",
        "        n.append(a)\n",
        "    else:\n",
        "        pass\n",
        "    a+=1\n",
        "print(*n)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "jEKcxR2Np2PU",
        "outputId": "b2a5db50-a5a8-4046-cba5-2b98984df7de"
      },
      "execution_count": 4,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "231 372 513 654 795 936\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "На вход программе подается натуральное число N (то есть, положительное, целое). Требуется его прочитать и создать двумерный (вложенный) список размером N x N элементов, состоящий из всех единиц, а затем, в последний столбец записать пятерки. Вывести этот список на экран в виде таблицы чисел, как показано в примере ниже."
      ],
      "metadata": {
        "id": "lQDEbuGcp5Jz"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "n = int(input())\n",
        "a = [[1]*n for k in range(n)]\n",
        "for j in range(n):\n",
        "    a[j][n-1] = 5\n",
        "for x in a:\n",
        "    print(' '.join(map(str, x)))"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "gCb21WV5qHzS",
        "outputId": "f2227922-3fcb-430f-94b0-dc373c7ac5f2"
      },
      "execution_count": 5,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "4\n",
            "1 1 1 5\n",
            "1 1 1 5\n",
            "1 1 1 5\n",
            "1 1 1 5\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "На вход программе подается натуральное число n. Необходимо его прочитать и найти все простые числа (нацело делятся только на 1 и на себя), которые меньше числа n, то есть, в диапазоне [2; n). Результат вывести на экран в строчку через пробел."
      ],
      "metadata": {
        "id": "uFZgbpINqTQs"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "n = int(input())\n",
        "a = []\n",
        "for j in range(2, n):\n",
        "    for k in range(2,int(j**0.5)+1):\n",
        "        if j%k==0:\n",
        "            break\n",
        "    else:\n",
        "        a.append(j)\n",
        "print(*a)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "LaRHWgp0qY7z",
        "outputId": "844dfd95-4251-4917-cc73-787a9c63ceb8"
      },
      "execution_count": 6,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "11\n",
            "2 3 5 7\n"
          ]
        }
      ]
    }
  ]
}